app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE (1) LIMIT 1
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def edit
    if params[:artist_id]
      @artist = Artist.find_by(params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found"
      elsif @song = @artist.songs.find_by(id: params[:id])